{
  "language": "EN",
  "hello_name": "<0>Sou João.</0>",
  "aboutNav": "Sobre",
  "abilitiesNav": "Skills",
  "contactNav": "Contato",
  "intro": "Um <1>Full Stack Developer</1> e <4>Designer</4> residido no Brasil usando criatividade para construir experiências impactantes e memoráveis e, ama minimalismo, jogos e uma boa aventura!",
  "aboutTitleLabel": "ouça a",
  "aboutTitle": "MINHA <1>HISTÓRIA</1>",
  "about": "Desde criança eu adorava jogar videogame, minha primeira linguagem de programação foi LUA usando um simples Bloco de Notas porque muitos jogos naquele tempo eram feitos com ela.<1 />Depois do ensino médio, eu decidi que queria fazer as coisas de um jeito melhor, fui para uma faculdade para aprender análise e desenvolvimento de sistemas e comecei a trabalhar com o que eu sempre quis. Eu dediquei vários anos à aprender e melhorar minhas habilidades e criatividade para sempre ser respeitoso e dar o melhor para meus colegas de trabalho, amigos e clientes tanto como desenvolvedor como designer.",
  "btnTalk": "Vamos conversar!",
  "skillsTitleLabel": "confira algumas das",
  "skillsTitle": "MINHAS <1>HABILIDADES</1>",
  "cssSkill": "<0>Aprendido: </0>SASS, CSS-in-JS, todas as propriedades de estilo, todos os tipos de unidade (em, rem, ch, vh, vw, etc...), pseudo-classes e pseudo-elementos, grid, flexbox, bootstrap framework.<2 /><3>Não aprendi: </3>-",
  "htmlSkill": "<0>Aprendido: </0> Quase todas as tags HTML e casos de uso.<2 /><3>Não aprendi: </3> Propriedades de acessibilidade (ARIA) e tags mais incomuns.",
  "jsSkill": "<0>Aprendido: </0>Typescript, CommonJS, V8 engine, JS Runtime, Prototypes, Generic Functions, Promises, Async/Await (ES8), API/Fetch calls, Variable Declarations, Classes, Jquery. <2 /> <3>Não aprendi: </3>Expressões Regulares",
  "nodeSkill": "<0>Aprendido: </0>REPL, Modulós, NodeJS Environment, Middlewares, NPM e Semântica de Versionamento, RESTful APIs, GraphQL, JWT e OAuth 2.0<2 /> <3>Não aprendi: </3>Docker, CI/CD, ORMs",
  "reactSkill": "<0>Aprendido: </0>CRA, Vite, Componentes Funcionais/Classe, Hooks, Context API, Redux/Saga, Rendering, Styled Components, Apollo Client, Typescript, Gatsby (Basics), Testing <2 /> <3>Não aprendi: </3>PWA",
  "sqlSkill": "<0>Aprendido: </0>Statements, Cláusulas, Operadores, Estrutura de Banco de Dados, UML and DER (Engenharia de Software), PostgreSQL and MySQL <2 /> <3>Não aprendi: </3>Oracle, NoSQL (exceto MongoDB), Melhores Práticas de Segurança",
  "gitSkill": "<0>Aprendido: </0>Github + CLI, Github Actions (básico), Markup Language, Repositories, Branches and Versioning, Pull Requests <2 /> <3>Não aprendi: </3>Github Pages, Qualquer solução git além de Github",
  "contactTitleLabel": "quer saber mais sobre mim?",
  "contactTitle": "Vamos criar algo grandioso juntos!",
  "copyright": "© 2022 Todos os direitos reservados<1/>Desenhado e desenvolvido por mim",
  "resume": "https://jhones.co/resume_br.pdf"
}
