{
  "language": "PT",
  "hello_name": "<0>I'm John.</0>",
  "aboutNav": "About",
  "abilitiesNav": "Abilities",
  "contactNav": "Contact",
  "intro": "A <1>Full Stack Developer</1> and <4>Designer</4> based in Brazil using creativity to craft impactful and memorable experiences and loves minimalism, games and a good adventure!",
  "aboutTitleLabel": "listen to",
  "aboutTitle": "MY <1>STORY</1>",
  "about": "Since I was a child, I loved to play games, my first programming language was LUA using a simple Notepad because many games at that time were made with it.<1 />After high school, I decided that I wanted to do things better, I went to a college to learn systems analysis and development and started working with what I always wanted. I dedicated several years to learn and improve my skills and creativity to always be respectful and give the best for my teammates, friends and my clients both as a developer and designer.",
  "btnTalk": "Let's Talk!",
  "skillsTitleLabel": "check out some of",
  "skillsTitle": "MY <1>ABILITIES</1>",
  "cssSkill": "<0>Learned: </0>SASS, CSS-in-JS, all style properties, all unit types (em, rem, ch, vh, vw, etc...), pseudo-classes and pseudo-elements, grid, flexbox, bootstrap framework.<2 /><3>Not learned: </3>-",
  "htmlSkill": "<0>Learned: </0> Almost every HTML tag and use cases.<2 /><3>Not learned: </3> Accessible properties (ARIA) and most uncommon tags.",
  "jsSkill": "<0>Learned: </0>Typescript, CommonJS, V8 engine, JS Runtime, Prototypes, Generic Functions, Promises, Async/Await (ES8), API/Fetch calls, Variable Declarations, Classes, Jquery. <2 /> <3>Not learned: </3>Regular expressions",
  "nodeSkill": "<0>Learned: </0>REPL, Modules, NodeJS Environment, Middlewares, NPM and Semantic Versioning, RESTful APIs, GraphQL, JWT and OAuth 2.0 <2 /> <3>Not learned: </3>Docker, CI/CD, ORMs",
  "reactSkill": "<0>Learned: </0>CRA, Vite, Functional/Class Components, Hooks, Context API, Redux/Saga, Rendering, Styled Components, Apollo Client, Typescript, Gatsby (Basics), Testing <2 /> <3>Not learned: </3>PWA",
  "sqlSkill": "<0>Learned: </0>Statements, Clauses, Operators, Database Structure, UML and ERD (Software Engineering), PostgreSQL and MySQL <2 /> <3>Not learned: </3>Oracle, NoSQL (except MongoDB), Best Security Practices",
  "gitSkill": "<0>Learned: </0>Github + CLI, Github Actions (basics), Markup Language, Repositories, Branches and Versioning, Pull Requests <2 /> <3>Not learned: </3>Github Pages, Any git solution besides Github",
  "contactTitleLabel": "want to know more about me?",
  "contactTitle": "Let's make something great together!",
  "copyright": "© 2022 All rights reserved<1/>Designed and developed by me",
  "resume": "https://jhones.co/resume.pdf"
}
